#Вариант 13.
#1. Даны три целых числа: A, B, C. Проверить истинность высказывания: «Хотя бы одно
#из чисел A, B, C положительное».
A, B, C = int(input("Введите число A: ")), int(input("Введите число B: ")), int(input("Введите число C: "))
if (A>0) or (B>0) or (C>0):
    print("Хотя бы 1 число положительное")
else:
    print("Нет положительных чисел")

#2. Дан номер года (положительное целое число). Определить количество дней в этом
#году, учитывая, что обычный год насчитывает 365 дней, а високосный — 366 дней.
#Високосным считается год, делящийся на 4, за исключением тех годов, которые
#делятся на 100 и не делятся на 400 (например, годы 300, 1300 и 1900 не являются
#високосными, а 1200 и 2000 — являются).



